newwms_gift/src/Documents/итWMSЗадачиИнвентаризации/итWMSЗадачиИнвентаризации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSЗадачиИнвентаризации</name>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.итWMSКонтрольнаяОперацияАгрегации</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.итWMSСписаниеТовара</types>
      <types>DocumentRef.итWMSИзменениеПараметровТовараВЯчейках</types>
      <types>DocumentRef.итWMSНаборка</types>
      <types>DocumentRef.итWMSДокументСвободнойАгрегации</types>
      <types>DocumentRef.итWMSПеремещение</types>
      <types>DocumentRef.итWMSОтгрузка</types>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаспределятьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьЯчейкиНаВремяИсполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаданияПоЯчейкам</name>
    <attributes>
      <name>ИдЗадачи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗадачи</name>
      <type>
        <types>EnumRef.итWMSСостоянияЗадачТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>Блокирована</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/InformationRegisters/итWMSЗадачиТСД/итWMSЗадачиТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итWMSЗадачиТСД</name>
  <resources>
    <name>ИдентификаторУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>172</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаОтправитель</name>
    <type>
      <types>CatalogRef.итСкладскиеЯчейки</types>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.итСкладскиеЯчейки</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.итWMSСостоянияЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксацияЗадачи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеДокументаТСД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТСД</name>
    <type>
      <types>CatalogRef.итWMSСправочникТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.итWMSКонтрольнаяОперацияАгрегации</types>
      <types>DocumentRef.итWMSРазмещение</types>
      <types>DocumentRef.итWMSЗадачиИнвентаризации</types>
      <types>DocumentRef.итWMSПроверка</types>
      <types>DocumentRef.итWMSНаборка</types>
      <types>DocumentRef.итWMSПеремещение</types>
      <types>DocumentRef.итWMSОтгрузка</types>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдЗадачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдЗадачиРодителя</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/InformationRegisters/итWMSСтрокиЗадачТСД/итWMSСтрокиЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итWMSСтрокиЗадачТСД</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРозлива</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДанныеДокументаТСД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдЗадачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>идСтроки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/Enums/итWMSСтатусыСкладскихДокументов/итWMSСтатусыСкладскихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSСтатусыСкладскихДокументов</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Зарезервирован</name>
  </enumValues>
  <enumValues>
    <name>Распределяется</name>
  </enumValues>
  <enumValues>
    <name>Распределен</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ВыполненСОшибкой</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
</mdclass:Enum>

newwms_gift/src/Enums/итWMSСостоянияЗадачТСД/итWMSСостоянияЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSСостоянияЗадачТСД</name>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетРазрешения</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
</mdclass:Enum>

newwms_gift/src/Enums/итWMSТипыЗадачТСД/итWMSТипыЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSТипыЗадачТСД</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
  </enumValues>
  <enumValues>
    <name>Наборка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКакЕсть</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>КонтрольнаяАгрегация</name>
  </enumValues>
  <enumValues>
    <name>Проверка</name>
  </enumValues>
  <enumValues>
    <name>Переупаковка</name>
  </enumValues>
</mdclass:Enum>

newwms_gift/src/Documents/итWMSЗадачиИнвентаризации/ObjectModule.bsl
Перем ОбработкаТСД Экспорт;
Перем СообщениеДляТСД Экспорт ; 
Перем ИгнорироватьОтказПриПроверках Экспорт ;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	итWMSСлужебныеПроцедурыИФункции.УстановитьРежимПроведенияЗавершенногоДокумента(СтатусДокумента,РежимПроведения);
	Если Проведен и РежимЗаписи=РежимЗаписиДокумента.Запись тогда
		РежимЗаписи=РежимЗаписиДокумента.Проведение;
	КонецЕсли;	
	Если  РежимЗаписи=РежимЗаписиДокумента.Проведение тогда
		ПередЗаписьюПроведение(Отказ, РежимЗаписи, РежимПроведения);
	КонецЕсли;	
	Если ЭтотОбъект.Проведен и РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения тогда
		ПередЗаписьюОтменаПроведения(Отказ, РежимЗаписи, РежимПроведения);
	КонецЕсли;	
КонецПроцедуры
Процедура ПередЗаписьюОтменаПроведения(Отказ, РежимЗаписи, РежимПроведения)
	Если СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Распределяется или  СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Зарезервирован  тогда
		СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Создан;
		БлокировкаДанных = новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.итWMSЗадачиТСД");
		ЭлементБлокировки.Режим=РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ДокументОснование",Ссылка);
		БлокировкаДанных.Заблокировать();
		
		ОчиститьСписокЗадач(Отказ,РежимЗаписи,РежимПроведения);
		
		для Каждого стр из ЗаданияПоЯчейкам цикл
			Если стр.Блокирована тогда
				ОбъектЯчейки=стр.Ячейка.ПолучитьОбъект();
				ОбъектЯчейки.Заблокирована=Ложь;
				ОбъектЯчейки.Записать();
				стр.Блокирована=Ложь;
			КонецЕсли;			
		КонецЦикла;
	ИначеЕсли СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Распределен тогда
		Отказ = Истина;
		Сообщить("Документ распределен на тсд и не может быть распроведен ");
		
	КонецЕсли;
	
	
	
КонецПроцедуры
Процедура ПередЗаписьюПроведение(Отказ, РежимЗаписи, РежимПроведения)
	Если СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Создан и НеРаспределятьНаТСД тогда
		СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Зарезервирован;
		для Каждого стр из ЗаданияПоЯчейкам цикл
			Если стр.Блокирована тогда
				ОбъектЯчейки=стр.Ячейка.ПолучитьОбъект();
				ОбъектЯчейки.Заблокирована=Ложь;
				ОбъектЯчейки.Записать();
				стр.Блокирована=Ложь;
			КонецЕсли;			
		КонецЦикла;
		
	ИначеЕсли СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Создан и не НеРаспределятьНаТСД  тогда
		СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Распределяется;
		для Каждого стр из ЗаданияПоЯчейкам цикл
			стр.СостояниеЗадачи=Перечисления.итWMSСостоянияЗадачТСД.КВыполнению;
			Если БлокироватьЯчейкиНаВремяИсполнения Тогда 
				Если не стр.Ячейка.Заблокирована тогда
					ОбъектЯчейки=стр.Ячейка.ПолучитьОбъект();
					ОбъектЯчейки.Заблокирована=Истина;
					ОбъектЯчейки.Записать();
					стр.Блокирована=Истина;
				КонецЕсли;
			КонецЕсли;
			Если не БлокироватьЯчейкиНаВремяИсполнения Тогда 
				Если стр.Блокирована Тогда 
					ОбъектЯчейки=стр.Ячейка.ПолучитьОбъект();
					ОбъектЯчейки.Заблокирована=Ложь;
					ОбъектЯчейки.Записать();
					стр.Блокирована=Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Зарезервирован и не НеРаспределятьНаТСД  тогда
		СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Распределяется;
		для Каждого стр из ЗаданияПоЯчейкам цикл
			стр.СостояниеЗадачи=Перечисления.итWMSСостоянияЗадачТСД.КВыполнению;
			Если БлокироватьЯчейкиНаВремяИсполнения Тогда 
				
				Если не стр.Ячейка.Заблокирована тогда
					ОбъектЯчейки=стр.Ячейка.ПолучитьОбъект();
					ОбъектЯчейки.Заблокирована=Истина;
					ОбъектЯчейки.Записать();
					стр.Блокирована=Истина;
				КонецЕсли;	
			КонецЕсли;	
			Если не БлокироватьЯчейкиНаВремяИсполнения Тогда 
				Если стр.Блокирована Тогда 
					ОбъектЯчейки=стр.Ячейка.ПолучитьОбъект();
					ОбъектЯчейки.Заблокирована=Ложь;
					ОбъектЯчейки.Записать();
					стр.Блокирована=Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Распределяется тогда
	РаспределениеДокументаНаЗадачиТСД(Отказ,РежимПроведения);	
КонецЕсли;
Если СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Завершен Тогда 
	для Каждого стр из ЗаданияПоЯчейкам цикл
			Если стр.Блокирована тогда
				ОбъектЯчейки=стр.Ячейка.ПолучитьОбъект();
				ОбъектЯчейки.Заблокирована=Ложь;
				ОбъектЯчейки.Записать();
				стр.Блокирована=Ложь;
			КонецЕсли;			
		КонецЦикла;
КонецЕсли;
КонецПроцедуры
Процедура ОчиститьСписокЗадач(Отказ,РежимЗаписи=Неопределено,РежимПроведения)
	
	БлокировкаДанных = новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.итWMSЗадачиТСД");
	ЭлементБлокировки.Режим=РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ДокументОснование",Ссылка);
	БлокировкаДанных.Заблокировать();
		НаборЗаписей= РегистрыСведений.итWMSЗадачиТСД.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументОснование.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		ДанныеОбхода=НаборЗаписей;
	МассивЗафиксированныхЗадач=ПолучитьЗафиксированныйМассивЗадач();
	для Каждого стр из ДанныеОбхода цикл
		Если МассивЗафиксированныхЗадач.Найти(стр.ИдЗадачи)<> Неопределено Тогда 
			Продолжить;
		КонецЕсли;	
		///////////////////////Очистка Задач построчно
		НаборЗаписей_1=РегистрыСведений.итWMSЗадачиТСД.СоздатьНаборЗаписей();
		НаборЗаписей_1.Отбор.ДокументОснование.Установить(Ссылка);
		НаборЗаписей_1.Отбор.ИдЗадачи.Установить(стр.ИдЗадачи);
		НаборЗаписей_1.Прочитать();
		НаборЗаписей_1.Очистить();
		НаборЗаписей_1.Записать();
		
		////////////////////Очистка Строк Задач
		НаборЗаписей_2=РегистрыСведений.итWMSСтрокиЗадачТСД.СоздатьНаборЗаписей();
		НаборЗаписей_2.Отбор.ИдЗадачи.Установить(стр.ИдЗадачи);
		НаборЗаписей_2.Прочитать();
		НаборЗаписей_2.Очистить();
		НаборЗаписей_2.Записать();
	КонецЦикла;

	КонецПроцедуры

Функция ПолучитьЗафиксированныйМассивЗадач()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итWMSЗадачиИнвентаризацииЗаданияПоЯчейкам.ИдЗадачи
	|ПОМЕСТИТЬ ВТИдЗадач
	|ИЗ
	|	Документ.итWMSЗадачиИнвентаризации.ЗаданияПоЯчейкам КАК итWMSЗадачиИнвентаризацииЗаданияПоЯчейкам
	|ГДЕ
	|	итWMSЗадачиИнвентаризацииЗаданияПоЯчейкам.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	итWMSЗадачиТСД.ИдЗадачи
	|ИЗ
	|	ВТИдЗадач КАК ВТИдЗадач
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.итWMSЗадачиТСД КАК итWMSЗадачиТСД
	|		ПО ВТИдЗадач.ИдЗадачи = итWMSЗадачиТСД.ИдЗадачи
	|			И (итWMSЗадачиТСД.ДокументОснование = &Ссылка)
	|ГДЕ
	|	итWMSЗадачиТСД.ФиксацияЗадачи";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();;
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("ИдЗадачи");	
КонецФункции

Процедура РаспределениеДокументаНаЗадачиТСД(Отказ,РежимПроведения)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	ОчиститьСписокЗадач(Отказ,,РежимПроведения);
    Если Отказ Тогда 
		Возврат
	КонецЕсли;		
	НаборЗаписей= РегистрыСведений.итWMSЗадачиТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументОснование.Установить(Ссылка);
	НаборЗаписей.Прочитать();
		

	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMSЗадачиИнвентаризацииЗаданияПоЯчейкам.ИдЗадачи,
		|	итWMSЗадачиИнвентаризацииЗаданияПоЯчейкам.Ячейка,
		|	итWMSЗадачиИнвентаризацииЗаданияПоЯчейкам.СостояниеЗадачи
		|ИЗ
		|	Документ.итWMSЗадачиИнвентаризации.ЗаданияПоЯчейкам КАК итWMSЗадачиИнвентаризацииЗаданияПоЯчейкам
		|ГДЕ
		|	итWMSЗадачиИнвентаризацииЗаданияПоЯчейкам.Ссылка = &Ссылка
		|	И итWMSЗадачиИнвентаризацииЗаданияПоЯчейкам.СостояниеЗадачи <> ЗНАЧЕНИЕ(перечисление.итwmsСостоянияЗадачТсд.Выполнена)
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSЗадачиИнвентаризацииЗаданияПоЯчейкам.ИдЗадачи,
		|	итWMSЗадачиИнвентаризацииЗаданияПоЯчейкам.Ячейка,
		|	итWMSЗадачиИнвентаризацииЗаданияПоЯчейкам.СостояниеЗадачи";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	НоваяЗапись=НаборЗаписей.Добавить();
	НоваяЗапись.ИдЗадачи=ВыборкаДетальныеЗаписи.ИдЗадачи;
	НоваяЗапись.ЯчейкаОтправитель=ВыборкаДетальныеЗаписи.Ячейка;
	НоваяЗапись.ЯчейкаПолучатель=ВыборкаДетальныеЗаписи.Ячейка;
    НоваяЗапись.ДокументОснование=Ссылка;
	НоваяЗапись.ТипЗадачи=Перечисления.итWMSТипыЗадачТСД.Инвентаризация;
	НоваяЗапись.Состояние=Перечисления.итWMSСостоянияЗадачТСД.КВыполнению;
	КонецЦикла;
	НаборЗаписей.Записать();
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры
#Область ОбязательныеПроцедурыИФункции
Процедура ДействияПриОтказеОтИсполненияДокумента()Экспорт 
	ЭтотОбъект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Распределяется;	
КонецПроцедуры

Процедура ДействияПриФиксацииЗадачДокумента() Экспорт 
	ЭтотОбъект.СтатусДокумента=Перечисления.итWMSСтатусыСкладскихДокументов.Завершен;
	ДатаЗавершенияДокумента=ТекущаяДата();
КонецПроцедуры

#КонецОбласти
